#+TITLE: Writing Tests

#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE

- Writing code and developing with tests in mind.
- Unit tests, property tests, characterization tests, and other approaches to
  testing.
- Improving code quality.

#+BEGIN_QUOTE
Haskell type system has limits of what it can prove, you still need tests to be
closer to software correctness.
#+END_QUOTE

** Unit Testing
#+BEGIN_SRC haskell
import Test.Tasty

main = defaultMain $ testGroup "nothing yet" []

main
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE

All 0 tests passed (0.00s)
,*** Exception: ExitSuccess
#+END_EXAMPLE

Lets test ~buildIP~ function

#+BEGIN_SRC haskell
<<ip-lookup>>

import Test.Tasty
import Test.Hspec
import Test.Tasty.Hspec

:{
spec_buildIP :: Spec
spec_buildIP =
  describe "buildIP" $ do
    it "builds from zero" $
      buildIP [0,0,0,0] `shouldBe` (IP 0)
    it "builds from one" $
      buildIP [0,0,0,1] `shouldBe` (IP 1)
    it "builds from localhost" $
      buildIP [127,0,0,1] `shouldBe` (IP $ 1 + 127 * 256^3)
    it "builds from arbitrary address" $
      buildIP [192,168,3,15] `shouldBe` (IP $ 15 + 3 * 256 + 168 * 256^2 + 192 * 256^3)
:}

:{
spec_lookupIP :: Spec
spec_lookupIP =
  describe "lookupIP" $ do
  let empty_iprdb = IPRanges []
      sample_iprdb = IPRanges [ IPRange (IP 0) (IP 1)
                              , IPRange (IP 100) (IP 120)
                              ]
      ip1 = IP 110
      ip2 = IP 50
  it "no IP in empty list" $
    ip1 `shouldNotSatisfy` lookupIP empty_iprdb
  it "IP in sample list" $
    ip1 `shouldSatisfy` lookupIP sample_iprdb
  it "no IP in sample list" $
    ip2 `shouldNotSatisfy` lookupIP sample_iprdb
:}

:{
main = do
  specs <- concat <$> mapM testSpecs [ spec_buildIP, spec_lookupIP ]
  defaultMain $ testGroup "All Tests" specs
:}

main
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
All Tests
  buildIP
    builds from zero:              OK
    builds from one:               OK
    builds from localhost:         OK
    builds from arbitrary address: OK
  lookupIP
    no IP in empty list:           OK
    IP in sample list:             OK
    no IP in sample list:          OK

All 7 tests passed (0.00s)
,*** Exception: ExitSuccess
#+END_EXAMPLE

** Property Based Testing

#+BEGIN_SRC haskell
<<ip-lookup>>

import Hedgehog
import qualified Hedgehog.Gen as Gen
import qualified Hedgehog.Range as Range

import Test.Tasty
import Test.Tasty.Hedgehog

import Data.List (intersperse)

-- Generator

:{
genIP :: Gen IP
genIP = IP <$> Gen.word32 Range.linearBounded
:}

-- NOTE: second one must be greater than first one

:{
genIPRange :: Gen IPRange
genIPRange = do
  (IP ip1) <- genIP
  ip2 <- Gen.word32 (Range.linearFrom (ip1 + 1) ip1 maxBound)
  pure $ IPRange (IP ip1) (IP ip2)
:}

Gen.sample genIP
Gen.sample genIPRange

:{
instance Show IP where
  show (IP ip) = concat $ intersperse "." $ map show [b4,b3,b2,b1]
    where
      (ip1, b1) = ip `divMod` 256
      (ip2, b2) = ip1 `divMod` 256
      (b4, b3) = ip2 `divMod` 256
:}

:{
prop_parseIP :: Property
prop_parseIP  = property $ do
  ip <- forAll genIP
  tripping ip show parseIP
:}

:{
main = do
  defaultMain $ testGroup "All Tests"
    [
      testProperty "parseIP agrees with show" prop_parseIP
    ]
:}

main
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
IP {unIP = 522532552}
All Tests
  parseIP agrees with show: OK
      ✓ <interactive> passed 100 tests.

All 1 tests passed (0.00s)
,*** Exception: ExitSuccess
#+END_EXAMPLE


